src/Documents/ИзменениеФорматовПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИзменениеФорматовПодразделения</Name>
			<Comment>Изменение форматов подразделения</Comment>
			<BasedOn>
				<xr:Item>Document.ИзменениеФорматовПодразделения</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>InformationRegister.ФорматыАссортиментаПодразделений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Comment>Дата начала действия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеЗакупочныхЦен</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеГруппАссортиментаПодразделения</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеФорматовПодразделения</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеСодержанияГруппАссортимента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Списываемые товары</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматПредыдущий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ФорматыАссортиментаПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФорматыАссортиментаПодразделений</Name>
			<Comment>Форматы ассортимента подразделений</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ИзменениеФорматовПодразделения/Ext/ManagerModule.bsl
// Модуль менеджера документа "Изменение ассортимента подразделения"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("КурсДокумента");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	ОбязательныеРеквизиты.Добавить("ДатаНачалаДействия");
	
	Если НЕ ПравоПользователя("ПроведениеНезаполненныхДокументов", Объект) Тогда
		ОбязательныеРеквизиты.Добавить("Товары");
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("Товары.Номенклатура");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;

КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Уникальные поля таблицы товаров
	УникальныеТовары = Новый Массив();
	УникальныеТовары.Добавить("Номенклатура");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеТабличныеЧасти = Новый Структура();
	УникальныеТабличныеЧасти.Вставить("Товары",УникальныеТовары);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеТабличныеЧасти;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ОбъектЗаполнен", Объект.Товары.Количество() > 0);
	
	Возврат ПараметрыДействия;
	
КонецФункции

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	Если НЕ Объект.ДатаНачалаДействия = Объект.Дата Тогда
		ПараметрыДействия.Вставить("ТребуетсяИзменитьДатуВвода", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Валюта".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВалютаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс документа".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КурсДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КурсДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КурсДокументаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в таблице "Товары".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТоварыНоменклатураПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(Строка.Номенклатура) И ЗначениеЗаполнено(Объект.ПодразделениеАссортимента) Тогда
		СрезФорматаТекущий = РегистрыСведений.ФорматыАссортиментаПодразделений.ПолучитьПоследнее(Новый Граница(Объект.ДатаНачалаДействия,ВидГраницы.Исключая),Новый Структура("Номенклатура, ПодразделениеКомпании",Строка.Номенклатура, Объект.ПодразделениеАссортимента));
		Строка.Формат = СрезФорматаТекущий.Формат;
	Иначе
		Строка.Формат = Справочники.ФорматыКатегорий.ПустаяСсылка();
	КонецЕсли;	
	Строка.ФорматПредыдущий = Строка.Формат;
		
	// Вызываем общий обработчик события
	//ОбработкаТабличнойЧастиТовары.НоменклатураПриИзменении(Объект, Строка, ПараметрыДействия);
	
	// Проверим, имеют ли смысл дальнейшие действия
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Отказ", ЛОЖЬ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.ИзменениеФорматовПодразделения",
		"ПФ_MXL_ИзменениеФорматовАссортиментаПодразделения",
		НСтр("ru = 'Изменение форматов подразделения'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ИзменениеФорматовАссортиментаПодразделения") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_ИзменениеФорматовАссортиментаПодразделения",
															НСтр("ru = 'Изменение форматов ассортимента подразделения'"),
															ПечатьИзменениеФорматовПодразделения(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;	
КонецПроцедуры // Печать()

// Формирует печатную форму "ИзменениеАссортиментаПодразделения"
//
Функция ПечатьИзменениеФорматовПодразделения(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИзменениеФорматовПодразделения_ИзменениеФорматовПодразделения";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИзменениеФорматовПодразделения.ПФ_MXL_ИзменениеФорматовАссортиментаПодразделения");
		
		ОбластьШапкаТаблицы    = УправлениеПечатьюПлатформа.ПривестиМакетПечатнойФормы(Макет, Документ);
		ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
		ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
		ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьПодвал          = Макет.ПолучитьОбласть("Подвал");
		
		// дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеАссортимента);
		
		// вывод заголовка документа
		ОбластьЗаголовок.Параметры.Заполнить(Документ);
		ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ, Документ.ХозОперация.Наименование);
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		Если ЗначениеЗаполнено(Документ.ПодразделениеАссортимента) И ЗначениеЗаполнено(Документ.ПодразделениеАссортимента.КПП) Тогда
			СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.ПодразделениеАссортимента.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
			ОбластьЗаголовок.Параметры.ПредставлениеОрганизации	= СтрЗаменить(СтрокаПредставления, ОбщегоНазначения.ПолучитьКППНаДату(Документ.ПодразделениеАссортимента.Организация, ДатаДокумента), ОбщегоНазначения.ПолучитьКППНаДату(Документ.ПодразделениеАссортимента, ДатаДокумента));
		Иначе	
			ОбластьЗаголовок.Параметры.ПредставлениеОрганизации	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.ПодразделениеАссортимента.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.ПредставлениеПодразделения = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.ПодразделениеАссортимента,,,,ДатаДокумента);
				
		// выводим свойства
		УправлениеПечатьюПлатформа.ЗаполнитьСвойствамиОбъекта(ОбластьЗаголовок, Документ);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);

		// готовим шапку
		НомерСтраницы = 2; НомерСтраницыПред = 2;
		СтруктураИтоговПоСтранице = Новый Структура();
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
		
		// готовим области строки
		ВыборкаТабличнойЧасти = Документ.Товары;
		Для каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
			СтруктураСтроки = УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(СтрокаТЧ,Документ);
			ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
			
			// доп. области
			мсвДопОбластиПодвала = Неопределено;
			Если Документ.Товары.Индекс(СтрокаТЧ) = Документ.Товары.Количество()-1 Тогда
				мсвДопОбластиПодвала = Новый Массив;
				мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
			КонецЕсли;
			
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ, мсвДопОбластиПодвала);
			// инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура();
				НомерСтраницыПред		  = НомерСтраницы;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			КонецЕсли;
			
		КонецЦикла;
		
		// выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтогоПоСтранице,СтруктураИтоговПоСтранице,Документ);
		КонецЕсли;

		//// Выводим представления и расшифровки подписей
		//ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"Ответственный","Ответственный"));
		//ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"Получил","Получил"));
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции //ПечатьИзменениеАссортиментаПодразделения()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
//ПараметрыКоманды = Новый Структура();
	//ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "Подразделение", "Справочник.ПодразделенияКомпании.ФормаВыбора", ,, Истина, НСтр("ru = 'Необходимо выбрать подразделение ассортимента.'"));
	//ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоАссортиментуДругогоПодразделения", "ТоварыЗаполнитьПоАссортиментуПодразделения", "Товары", НСтр("ru = 'Заполнить по ассортименту другого подразделения'"), ПараметрыКоманды);
	//
	//ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоАссортиментуПодразделения", "ТоварыЗаполнитьПоАссортиментуПодразделения", "Товары", НСтр("ru = 'Заполнить по ассортименту подразделения'"));
	//
	//
	//ПараметрыКоманды = Новый Структура();
	//ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "Подразделение", "Справочник.ПодразделенияКомпании.ФормаВыбора", ,, Истина, НСтр("ru = 'Необходимо выбрать подразделение ассортимента.'"));
	//ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаНоменклатуры","Справочник.Номенклатура.Форма.ФормаВыбораГруппы",,, Истина, НСтр("ru = 'Необходимо выбрать группу номенклатуры.'"));
	//ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоАссортиментуДругогоПодразделенияПоГруппе", "ТоварыЗаполнитьПоАссортиментуПодразделения", "Товары", НСтр("ru = 'Заполнить по ассортименту другого подразделения по группе товаров'"), ПараметрыКоманды);
	//
	//ПараметрыКоманды = Новый Структура();
	//ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаНоменклатуры","Справочник.Номенклатура.Форма.ФормаВыбораГруппы",,, Истина, НСтр("ru = 'Необходимо выбрать группу номенклатуры.'"));
	//ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоАссортиментуПодразделенияПоГруппе", "ТоварыЗаполнитьПоАссортиментуПодразделения", "Товары", НСтр("ru = 'Заполнить по ассортименту подразделения по группе товаров'"));
	
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьВсемиГруппами", "ТоварыЗаполнитьНоменклатурой", "Товары", НСтр("ru = 'Заполнить всеми группами'"));
	
	ПараметрыКоманды = Новый Структура();
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ГруппаНоменклатуры","Справочник.Номенклатура.Форма.ФормаВыбораГруппы",,, Истина, НСтр("ru = 'Необходимо выбрать группу номенклатуры.'"));
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ТоварыЗаполнитьПоГруппеНоменклатуры", "ТоварыЗаполнитьНоменклатурой", "Товары", НСтр("ru = 'Заполнить группы по группе номенклатуры'"), ПараметрыКоманды);
	
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьВсемиГруппами.Видимость",         Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьВсемиГруппами.Доступность",       Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоГруппеНоменклатуры.Видимость",      Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоГруппеНоменклатуры.Доступность",    Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоАссортиментуДругогоПодразделения.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоАссортиментуДругогоПодразделения.Доступность", Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоАссортиментуПодразделения.Видимость",   Истина);
	ПараметрыКоманд.Вставить("ТоварыЗаполнитьПоАссортиментуПодразделения.Доступность", Истина);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Обработчик заполнения полей таблицы
//
Функция ЗаполнитьТоварныйРеквизит(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	
КонецФункции // ЗаполнитьТоварныйРеквизит()

// Обработчик заполнения документа выбранной группой или всей номенклатурой
//
Функция ТоварыЗаполнитьНоменклатурой(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	Родитель=Неопределено;
	Если ПараметрыЗаполнения.ИмяКоманды="ТоварыЗаполнитьПоГруппеНоменклатуры" Тогда
		Родитель = ПараметрыЗаполнения.ГруппаНоменклатуры;
	КонецЕсли;
	
	//Запрос групп третьего уровня
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НоменклатураСправочник.Ссылка КАК Ссылка,
	                      |	Форматы.Формат КАК Формат
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК НоменклатураСправочник
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФорматыАссортиментаПодразделений.СрезПоследних(&НаДату, ПодразделениеКомпании = &ПодразделениеКомпании) КАК Форматы
	                      |		ПО (Форматы.Номенклатура = НоменклатураСправочник.Ссылка)
	                      |ГДЕ
	                      |	НоменклатураСправочник.ЭтоГруппа = ИСТИНА
	                      |	И НЕ ЕСТЬNULL(НоменклатураСправочник.Родитель.Родитель.Код, 0) = 0
	                      |	И ЕСТЬNULL(НоменклатураСправочник.Родитель.Родитель.Родитель.Код, 0) = 0
	                      |	И (НЕ &ФильтПоРодителю
	                      |			ИЛИ НоменклатураСправочник.Ссылка В ИЕРАРХИИ (&Родитель))
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Форматы.Номенклатура.Ссылка ИЕРАРХИЯ");
	Запрос.УстановитьПараметр("Родитель",Родитель);
	Запрос.УстановитьПараметр("ФильтПоРодителю",НЕ Родитель=Неопределено);
	Запрос.УстановитьПараметр("НаДату",Объект.ДатаНачалаДействия);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",Объект.ПодразделениеАссортимента);
	
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Товары = Объект.Товары.Выгрузить();
	Пока Выборка.Следующий() Цикл
		// пропустим НЕ группы и все что есть в таблице
		//Если НЕ Выборка.ЭтоГруппа Тогда 
		//	Продолжить;
		//КонецЕсли;
		
		Если Товары.Найти(Выборка.Ссылка,"Номенклатура") <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
			
		// добавляем строку
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Ссылка;
		НоваяСтрока.ФорматПредыдущий = Выборка.Формат;
		НоваяСтрока.Формат = Выборка.Формат;
			
		// отработаем изменение номенклатуры
		Документы.ИзменениеФорматовПодразделения.ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
	КонецЦикла;
	
КонецФункции // ТоварыЗаполнитьНоменклатурой()

// Обработчик заполнения документа по ассортименту подразделения
//
Функция ТоварыЗаполнитьПоАссортиментуПодразделения(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	//ОтборПоНоменклатуре         = Найти(ПараметрыЗаполнения.ИмяКоманды, "ИГруппеНоменклатуры")>0;
	//ОтборПоБазовомуАссортименту = Найти(ПараметрыЗаполнения.ИмяКоманды, "ПоБазовомуАссортименту")>0;
	//
	//// Получаем данные по товарам выбранного подразделенеия
	//Запрос=Новый Запрос("
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ОграничениеАссортиментаПодразделения.Номенклатура КАК Номенклатура,
	//|	ОграничениеАссортиментаПодразделения.Цена КАК Цена,
	//|	ОграничениеАссортиментаПодразделения.ПроцентНаценки КАК ПроцентНаценки,
	//|	ОграничениеАссортиментаПодразделения.ЦенаРозничная КАК ЦенаРозничная,
	//|	ОграничениеАссортиментаПодразделения.СтавкаНДС КАК СтавкаНДС,
	//|	ОграничениеАссортиментаПодразделения.БазовыйАссортимент КАК БазовыйАссортимент,
	//|	ОграничениеАссортиментаПодразделения.ВидАссортимента КАК ВидАссортимента
	//|ИЗ
	//|	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&Дата, ПодразделениеКомпании=&ПодразделениеВыбораАссортимента" + ?(ОтборПоНоменклатуре, " И Номенклатура В ИЕРАРХИИ (&ВыбраннаяГруппа)", "") + " И НЕ Номенклатура В (&ТоварыИзменениеАссортиментаПодразделения)) КАК ОграничениеАссортиментаПодразделения
	//|ГДЕ
	//|	ОграничениеАссортиментаПодразделения.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)" + ?(ОтборПоБазовомуАссортименту, " И 
	//|	ОграничениеАссортиментаПодразделения.БазовыйАссортимент = ИСТИНА", "") + "
	//|УПОРЯДОЧИТЬ ПО
	//|	ОграничениеАссортиментаПодразделения.Номенклатура.Наименование,
	//|	ОграничениеАссортиментаПодразделения.Номенклатура
	//|");
	////ПараметрыЗаполнения.ИмяКоманды
	////|	ОграничениеАссортиментаПодразделения.БазовыйАссортимент = ИСТИНА
	//
	//Товары = Объект.Товары.Выгрузить();
	//
	//Запрос.УстановитьПараметр("ПодразделениеВыбораАссортимента",          ПараметрыЗаполнения.Подразделение);
	//Запрос.УстановитьПараметр("ТоварыИзменениеАссортиментаПодразделения", Товары.ВыгрузитьКолонку("Номенклатура"));
	//Запрос.УстановитьПараметр("Дата", Новый Граница(Объект.ДатаВводаВАссортимент, ВидГраницы.Исключая));
	//Если ОтборПоНоменклатуре Тогда
	//	Запрос.УстановитьПараметр("ВыбраннаяГруппа", ПараметрыЗаполнения.ГруппаНоменклатуры);
	//КонецЕсли;
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	НоваяСтрока              = Объект.Товары.Добавить();
	//	НоваяСтрока.Номенклатура = Выборка.Номенклатура;
	//	ТоварыНоменклатураПриИзменении(Объект, НоваяСтрока, Неопределено);
	//	
	//	НоваяСтрока.Цена               = Выборка.Цена;
	//	НоваяСтрока.ПроцентНаценки     = Выборка.ПроцентНаценки;
	//	НоваяСтрока.ЦенаРозничная      = Выборка.ЦенаРозничная;
	//	НоваяСтрока.СтавкаНДС          = Выборка.СтавкаНДС;
	//	НоваяСтрока.БазовыйАссортимент = Выборка.БазовыйАссортимент;
	//	НоваяСтрока.ВидАссортимента    = Выборка.ВидАссортимента;
	//КонецЦикла;
	
КонецФункции // ТоварыЗаполнитьПоАссортиментуПодразделения()



#КонецЕсли
